app/Controllers/LoginController.php

SELECT *
FROM `login`
WHERE `email` = 'Neel@gmail.com'
---
    public function authenticate()
    {

        $session = session();
		helper('custom');
        $db = db_connect();
        // if(isset($_POST['user']) && $_POST['pass']){
            // $email = $_POST['user'];
            // $password = $_POST['pass'];
            $email = $this->request->getVar('user');
            $password = md5($this->request->getVar('pass'));

            $query = $db->table('login')->where('email', $email)->get();